/*
Задача 68: 
   Напишите программу вычисления функции Аккермана с помощью
   рекурсии. Даны два неотрицательных числа m и n.
   m = 2, n = 3 -> A(m,n) = 29
*/

Console.Write("Введите число M= ");
int number1=Convert.ToInt32(Console.ReadLine());

Console.Write("Введите число N= ");
int number2=Convert.ToInt32(Console.ReadLine());

